app/views/questions/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 4 ORDER BY answers.created_at DESC
---

<% @question.answers.each do |answer| %>