wsa_bck/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" ORDER BY questions.created_at DESC
SELECT "users".* FROM "users"
---
  def index
    @questions = Question.all
    @users = User.all

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY questions.created_at DESC LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users"
---
  def show
    @question = Question.find(params[:id])
    @users = User.all

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY questions.created_at DESC LIMIT 1  [["id", "2"]]
---
  def edit
    @question = Question.find(params[:id])

INSERT INTO "questions" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @question = current_user.questions.new(params[:question])
      if @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY questions.created_at DESC LIMIT 1  [["id", "4"]]
UPDATE "questions" SET "updated_at" = '2012-02-29 02:06:05.198642', "title" = 'Third1' WHERE "questions"."id" = 3
---
  def update
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])