wsa_bck/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uid" = '28348819' AND "users"."provider" = 'twitter' LIMIT 1
---
  def twitter_create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)