app/controllers/answers_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY questions.created_at DESC LIMIT 1  [["id", "1"]]
INSERT INTO "answers" ("body", "created_at", "question_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Final!!! Please dont give any errors. :( "], ["created_at", Wed, 15 Feb 2012 20:25:41 UTC +00:00], ["question_id", 1], ["updated_at", Wed, 15 Feb 2012 20:25:41 UTC +00:00]]
UPDATE "answers" SET "user_id" = 4, "updated_at" = '2012-02-29 19:55:43.245401' WHERE "answers"."id" = 16
---
  def create
   @question = Question.find(params[:question_id])
   @answer = @question.answers.create!(params[:answer])
   @answer.user_id = current_user.id

   respond_to do |format|
      if @answer.save

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? ORDER BY answers.created_at DESC LIMIT 1  [["id", "4"]]
---
  def edit
     @answer = Answer.find(params[:id])