app/controllers/authentications_controller.rb

INSERT INTO "authentications" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 18 Apr 2012 08:31:30 UTC +00:00], ["provider", "twitter"], ["uid", "28348819"], ["updated_at", Wed, 18 Apr 2012 08:31:30 UTC +00:00], ["user_id", 5]]
SELECT "authentications".* FROM "authentications" WHERE "authentications"."user_id" = 7 AND "authentications"."provider" = 'twitter' AND "authentications"."uid" = '28348819' LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    current_user.authentications.find_or_create_by_provider_and_uid(auth['provider'], auth['uid'])