app/controllers/users_controller.rb

  def index
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def network
    @title = "All users"
    @users_c = User.find_all_by_country(User.find(params[:id]).country)
    @users_d = User.find_all_by_department(User.find(params[:id]).department)
    @users_l = User.find_all_by_level(User.find(params[:id]).level)
---
SELECT "users".* FROM "users" WHERE "users"."country" = 'India'
SELECT "users".* FROM "users" WHERE "users"."department" IS NULL
SELECT "users".* FROM "users" WHERE "users"."level" = 'Masters'

  def create
    @user = User.new(params[:user])
    #if @omniauth
      if @user.save
---
INSERT INTO "users" ("name", "salt", "admin", "updated_at", "created_at", "encrypted_password", "email", "country") VALUES ('Latha Maduri', '832cf2ff10bab52bfe6e02529766bd12fdece3ef83f7326aa2a3887132caf49a', 'f', '2011-12-09 21:46:12.748672', '2011-12-09 21:46:12.748672', '8ccecdd30c0730376a646bbd855cfc99af55e8e480a153a386662aec0fde192e', '275.madhu1@gmail.com', 'India')